Repository: vaeth/replacer
Catalog: po/*.po
Languages: de

source: Interactively replace python regular expressions in files. The specified SEARCH and REPLACE expressions are a regular expression and replace string following the python syntax, see e.g. https://docs.python.org/3/library/re.html or https://docs.python.org/2/library/re.html (exact features depending on your python interpreter). For the replace string, see in particular the description of the sub() function. In the terminology of the web pages, the arguments (as passed by the shell) are treated as “raw” strings.
de: Interaktive Ersetzung von regulären Python-Ausdrücken in Dateien. Die angegebenen Ausdrücke für SUCHE und ERSETZE sind ein regulärer Ausdruck bzw. Ersetzungstext gemäß Python-Syntax, siehe beispielsweise https://docs.python.org/3/library/re.html oder https://docs.python.org/2/library/re.html (Details hängen vom benutzten Python-Interpreter aber). Näheres über den Ersetzungstext findet man insbesondere in der Beschreibung der Funktion sub(). In der Terminologie der Webseiten werden die Ausdrücke (so wie sie von der Shell übergeben werden) als „raw strings” interpretiert.

source: chars (binary) mode: Treat chars instead of lines as units when formatting visual output. Thus, BEFORE, AFTER, CONTEXT, and printed numbers refer to character numbers instead of line numbers. Newline characters are output visually as “\n”.
de: Zeichenmodus/Binärmodus: Betrachte Zeichen statt Zeilen als Einheit bei der Formatierung der visuellen Ausgabe. Daher beziehen sich DAVOR, DANACH, KONTEXT und ausgegebene Zahlen auf Zeichenzahlen statt Zeilenzahlen. Zeilenvorschubzeichen werden visuell als „\n“ ausgegeben.

# help
source: BEFORE
de: DAVOR

# help
source: output lines of context before match
de: gibt Kontextzeilen vor dem Treffer aus

# help
source: AFTER
de: DANACH

# help
source: output lines of context after match
de: gibt Kontextzeilen nach dem Treffer aus

# help
source: CONTEXT
de: KONTEXT

# help
source: output lines of context before and after match
de: gibt Kontextzeilen vor und nach dem Treffer aus

# help
source: treat search expression as plain string
de: behandelt Suchausdruck als blanke Zeichenkette

# help
source: treat replace expression as plain string
de: behandelt Ersetzungstext als blanke Zeichenkette

# help
source: ENCODING
de: KODIERUNG

# help
source: file encoding, e.g. utf-8, cp1252, cp850, latin-1, see https://docs.python.org/3/library/codecs.html#standard-encodings (if not specified, empty or when the special value “binary” or “bytes” is used, the file is considered as a byte stream)
de: Datei-Codierung, beispielsweise utf-8, cp1252, cp850, latin-1, siehe https://docs.python.org/3/library/codecs.html#standard-encodings (falls nicht engegeben, leer, oder für die speziellen Werte „binary“ und „bytes“ wird die Datei als unkodierter Bytestrom betrachtet)

# help
source: file encoding if the -e encoding fails. Use the empty string or the argument of -e to avoid retrying.
de: Datei-Kodierung, wenn die Kodierung mit -e fehlschlägt. Die leere Zeichenkette oder das gleiche Argument wie bei -e verhindern einen erneuten Versuch.

# help
source: try to keep timestamps when modifying files
de: es wird versucht, die Zeitstempel bei der Modifizierung von Files beizubehalten

# help
source: grep mode, only show matches
de: grep-Modus; Treffer werden nur angezeigt

# help
source: grep mode, count matches in files
de: grep-Modus; Treffer werden in Files gezählt

# help
source: grep mode, list files with matches
de: grep-Modues; Files mit Treffern werden gelistet

# help
source: ignore case in search expression
de: ignorieren der Groß-/Kleinschreibung im Suchausdruck

# help
source: make ^ and $ in search expression consider each line
de: lässt ^ und $ im Suchausdruck Zeilen separat betrachten

# help
source: make . in search expression match newline, too
de: lässt . im Suchausdruck auch Zeilenvorschubzeichen erkennen

# help
source: make \w \W \b \B in search expression follow unicode rules
de: behandelt \w \W \b \B im Suchausdruck nach Unicode-Regeln

# help
source: make \w \W \b \B in search expression follow locale
de: behandelt \w \W \b \B im Suchausdruck nach locale-Regeln

# help
source: allow comments in search expression
de: erlaubt Kommentare im Suchausdruck

# help
source: recurse if FILE is a directory. When recursing, non-files and symbolic links to directories are tacitly ignored.
de: wenn DATEI ein Verzeichnis ist, wird dessen Inhalt rekursiv behandelt. Bei der Rekursion werden nicht-Dateien und symbolische Links auf Verzeichnisse stillschweigend ignoriert.

# help
source: PATTERN
de: MUSTER

# help
source: skip files/dirs whose paths match PATTERN. This option is accumulative
de: Übergeht Dateien/Verzeichnisse, deren Pfad MUSTER entspricht. Diese Option kann mehrmals angegeben werden.

# help
source: skip files/dirs whose paths do not match PATTERN. This option is accumulative
de: Übergeht Dateien/Verzeichnisse, deren Pfad nicht MUSTER entspricht. Diese Option kann mehrmals angegeben werden.

# help
source: set highlight mode. Default is --colors=dark. There are choices appropriate for terminals with dark (default) or light background or using only style attributes like reverse or underline. The latter might not work on all terminals. Under windows, it might be necessary to have the colorama package or ANSI emulation installed unless --colors=none is used.
de: legt den Farbmodus fest. Voreinstellung ist --colors=dark. Es gibt die Wahl zwischen Terminals mit dunklem („dark“ als Voreinstellung) und hellem („light”) Hintergrund oder die Benutzung von Auszeichnungen („style”) wie Zeicheninversion oder Unterstreichung. Letzteres geht vielleicht nicht auf allen Terminals. Unter Windows kann es notwendig sein, dass colorama-Paket oder ANSI-Emulation zu installieren, außer wenn --colors=none benutzt wird.

# help
source: always replace (twice to always write)
de: immer ersetzen (zweimal, um auch immer zu schreiben)

# help
source: do not print matches, quiet grep
de: keine Ausgabe der Treffer, grep ohne Ausgabe

# help
source: SEARCH
de: SUCHE

# help
source: search expression
de: Suchausdruck

# help
source: REPLACE
de: ERSETZE

# help
source: replace string
de: Ersetzungstext

# help
source: FILE
de: DATEI

# help
source: files to process
de: zu behandelnde Dateien

# replace
source: y(es)/n(o)/r(est of file)/q(uit this file)/a(lways)/A(lways quiet)/s(top all)
de: j(a)/n(ein)/r(est der Datei)/e(nde der Datei)/i(immer)/I(immer still)/s(top)

# replace
source: y
de: j

# replace
source: q
de: a

# replace
source: a
de: i

# replace
source: A
de: I

# write
source: write changes to {0}? y(es)/n(o)/w(rite always)/s(top all)
de: Änderungen nach {0} schreiben? j(a)/n(ein)/d(ateien immer)/s(top)

# replace
source: w
de: d

source: cannot open {0} for reading: {1}
de: kann {0} nicht zum Lesen öffnen: {1}

source: fallback encoding fails, too: {0}
de: Rückfall-Kodierung schlägt ebenfalls fehl: {0}

source: switching encoding {0}->{1} for {2}: {3}
de: Wechsel der Kodierung {0}->{1} für {2}: {3}

source: {0} encoding error for {1}: {2}
de: Fehler in {0}-Kodierung für {1}: {2}

source: error when reading {0}: {1}
de: Fehler beim Lesen von {0}: {1}

source: error when closing {0} after reading: {1}
de: Fehler beim Schließen von {0} nach Lesen: {1}

source: cannot get timestamp of {0}: {1}
de: Zeitstempel von {0} nicht lesbar: {1}

source: cannot open {0} for writing: {1}
de: Fehler beim Öffnen von {0} zum Schreiben: {1}

source: write error to {0}: {1}
de: Schreibfehler auf {0}: {1}

source: error when closing {0} after writing: {1}
de: Fehler beim Schließen von {0} nach Schreiben: {1}

source: cannot set timestamp of {0}: {1}
de: Fehler beim Setzen des Zeitstempels von {0}: {1}

source: no files specified
de: Keine Files angegeben

source: --before argument {0} is negative
de: --before hat negatives Argument {0}

source: --after argument {0} is negative
de: --after hat negatives Argument {0}

source: forgotten --recursive: directory: {0}
de: vergessenes --recursive: Datei ist Verzeichnis: {0}

source: not an accessible file: {0}
de: keine zugreifbare Datei: {0}

source: error: {0}
de: Fehler: {0}
